In [2]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find the data files in the README.

In [3]:
titles = pd.read_csv('data/titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [4]:
cast = pd.read_csv('data/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### 1. How many movies have the title "Hamlet"?

In [5]:
len(titles[titles['title'] == 'Hamlet'])

18

### 2. When was the first movie titled "Hamlet" made?

In [6]:
titles[titles['title']== 'Hamlet'].sort_values('year').head(1)

        title  year
46721  Hamlet  1910

### 3. How many movies were made in the year 1950?

In [7]:
len(titles[titles['year'] == 1950])

1099

### 4. How many movies were made from 1950 through 1959?

In [8]:
len(titles[(titles['year'] > 1950) & (titles['year'] < 1959)])

10132

### 5. In what years has a movie titled "Batman" been released?

In [9]:
titles[titles['title']=='Batman']

        title  year
56000  Batman  1989
74608  Batman  1943

### 6. How many roles were there in the movie "Inception"?

In [10]:
len(cast[cast['title']=="Inception"])

77

In [11]:
cast[cast['title']=="Inception"]

,title,year,name,type,character,n
94937,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
144039,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
177911,Inception,2010,Tom Berenger,actor,Browning,8.0
191432,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
251777,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
3259597,Inception,2010,Ellen Page,actress,Ariadne,3.0
3313720,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3340319,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3347057,Inception,2010,Talulah Riley,actress,Blonde,25.0
3582980,Inception,2010,Shannon Welles,actress,Old Mal,51.0

### 7. How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [12]:
len(cast[(cast['title']=="Inception") & (~cast['n'].isna())])

51

### 8. How many roles were credited in the silent 1921 version of Hamlet?

> Hint: There are a lot of "Hamlet" films, we want 1921 only

In [13]:
len(cast[(cast['title']=='Hamlet') & (cast['year']==1921)])

9

### 9. Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [14]:
cast[(cast['title']=='North by Northwest')& (cast['n'].notna())].sort_values(by='n')

,title,year,name,type,character,n
845516,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3382934,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1413409,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3043261,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
345822,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2941468,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1644542,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1236791,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2372617,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1757154,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
646039,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2225858,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
450691,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1463316,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
199768,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1343025,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### 10. Display the entire cast, in "n"-order, of the 1972 film "Sleuth". 

> Hint: There is more than one movie titled "Sleuth", we want 1972 only

In [17]:
# cast[(cast['title']=='North by Northwest')& (cast['n'].notna())].sort_values(by='n')

cast[(cast['title']=='Sleuth')&(cast['year']==1972)].sort_values(by='n')

,title,year,name,type,character,n
1654402,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
316652,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
362592,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1421434,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2635708,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1405219,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### 11. How many people have played an "Ophelia"?

In [18]:
len(cast[cast['character']=='Ophelia'])

111

### 12. How many roles has Sidney Poitier played throughout his career?

In [19]:
len(cast[cast['name']=="Sidney Poitier"])

43

### 13. List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [25]:
cast[
    (cast['name']=="Cary Grant")& 
    (cast['year']>1940) & 
    (cast['year']<1950) & 
    (cast['n']==2)
].sort_values(by='year')

                 title  year        name   type    character    n
845523  Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### 14. How many roles were avilable for actresses in the 1950s?

In [27]:
len(
    cast[
        (cast['type']=="actress") &
        (cast['year'] < 1949) &
        (cast['year'] < 1960)
    ]
)

134049

### 15. How many leading roles (n=1) were available from the beginning of film history through 1980?

In [28]:
len(
    cast[
        (cast['n']==1) &
        (cast['year'] < 1981)
    ]
)

64095

### 16. Which three years in the 1930s saw the most films released?

In [39]:
movies1930s = titles[
    (titles['year'] < 1940) &
    (titles['year'] > 1929)
    ]
yearlycount = movies1930s[
    'year'
].value_counts()

print(yearlycount.sort_values(ascending=False).head(3))

year
1937    1196
1936    1138
1938    1129
Name: count, dtype: int64

### 17. Count the number of "Hamlet" films made in each decade.

> Hint: You can use the same approach to finding the decade as you did in `01-Accessing`

In [53]:
titles['decade'] = (titles['year'] // 10) * 10
titles[titles['title']=='Hamlet'].sort_values(by='year')

         title  year  decade
46721   Hamlet  1910    1910
209878  Hamlet  1911    1910
166410  Hamlet  1913    1910
98554   Hamlet  1921    1920
6009    Hamlet  1948    1940
128388  Hamlet  1954    1950
182970  Hamlet  1964    1960
122704  Hamlet  1969    1960
221479  Hamlet  1973    1970
92146   Hamlet  1976    1970
94355   Hamlet  1987    1980
45350   Hamlet  1990    1990
201291  Hamlet  1996    1990
94554   Hamlet  2000    2000
176069  Hamlet  2009    2000
102919  Hamlet  2011    2010
223568  Hamlet  2014    2010
168965  Hamlet  2015    2010

In [50]:
titles[
    titles['title']=='Hamlet'
].value_counts('decade').sort_index()

decade
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    3
Name: count, dtype: int64

### 18. Count the number of "Rustler" characters in each decade of the history of film.

In [56]:
cast['decade'] = (cast['year'] // 10) * 10

Empty DataFrame
Columns: [title, year, name, type, character, n, decade]
Index: []

In [63]:
cast[cast['character']=="Rustler"].value_counts('decade').sort_index()

decade
1920     6
1930    84
1940    18
1950     8
1960     2
1970     9
1980     1
1990     4
2000     2
Name: count, dtype: int64

### 19. Who are the 10 people most often credited as "Herself" in film history?

In [70]:
cast[
    cast['character'] == "Herself"
].value_counts('name').head(10)

name
Queen Elizabeth II    11
Joyce Brothers         9
Margaret Thatcher      8
Hillary Clinton        7
Mary Jo Pehl           7
Joan Rivers            6
Sumie Sakai            6
Bunny Yeager           5
Kareena Kapoor         5
Rekha                  5
Name: count, dtype: int64

### 20. Which actors or actresses appeared in the most movies in the year 1945?

In [73]:
cast[
    cast['year']==1945
].value_counts('name').head(10)

name
Emmett Vogan       39
Sam (II) Harris    32
Bess Flowers       29
Harold Miller      29
Nolan Leary        27
Frank O'Connor     27
Franklyn Farnum    26
Larry Steers       25
Pierre Watkin      24
Tom London         24
Name: count, dtype: int64

### 21. What are the 10 most frequent roles that start with the phrase "Patron in"?

### 22. Count number of n-values of the roles that Judi Dench has played over her career.

### 23. How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?